print("--- مرحبا بك في تطبيق المبرمجة رؤيا ---")

while True:
    print("\nماذا تريدين أن تفعلي الآن؟")
    print("1. حساب المعدل الدراسي")
    print("2. طباعة جدول ضرب مخصص")
    print("3. إغلاق البرنامج")
    print("4. رسالة تشجيعية")
    print("5. معرفة عمركِ بعد 7 سنوات")

    choice = input("ادخلي رقم اختيارك (1,2,3,4,5): ")

    if choice == "1":
        math = float(input("الرياضيات: "))
        physics = float(input("الفيزياء: "))
        print(f"معدلك: {(math+physics)/2}")

    elif choice == "2":
        num = int(input("أي جدول ضرب؟ "))
        limit = int(input("إلى أي رقم؟ "))
        for i in range(1, limit + 1):
            print(f"{num} × {i} = {num * i}")

    elif choice == "4":
        for i in range(5):
            print("أنتِ مبرمجة ذكية يا رؤيا! 🌟")

    elif choice == "5":
        name = input("ما اسمكِ؟ ")
        age = int(input("كم عمركِ الآن؟ "))
        future_age = age + 7
        print(f"أهلاً يا {name}، بعد 7 سنوات سيكون عمركِ {future_age} سنة!")

    elif choice == "3":
        print("شكراً لاستخدامك تطبيقي. مع السلامة!")
        break 

    else:
        print("اختيار غير صحيح!")
